In [1]:
import pandas as pd

## Pass a URL to the pd.read_csv Method

In [2]:
url='https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv'
baby_names = pd.read_csv(url)

In [3]:
baby_names.head(3)

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42

## Quick Object Conversions

In [7]:
baby_names["Child's First Name"].to_frame()

      Child's First Name
0              GERALDINE
1                    GIA
2                 GIANNA
3                GISELLE
4                  GRACE
...                  ...
19413             Alayna
19414            Yaritza
19415             Mendel
19416              Isaac
19417            Alessia

[19418 rows x 1 columns]

In [13]:
new_data=', '.join(baby_names["Child's First Name"].str.title().drop_duplicates().sort_values())

In [21]:
list=new_data.split(', ')

In [23]:
pd.Series(list)

            0
0       Aahil
1     Aaliyah
2       Aarav
3       Aaron
4       Aarya
...       ...
1770      Zoe
1771     Zoey
1772     Zoya
1773     Zuri
1774   Zyaire

[1775 rows x 1 columns]

In [25]:
df = pd.Series(list).to_frame()

In [29]:
df.rename(columns= {0:'Names'}, inplace=True)

In [30]:
df

        Names
0       Aahil
1     Aaliyah
2       Aarav
3       Aaron
4       Aarya
...       ...
1770      Zoe
1771     Zoey
1772     Zoya
1773     Zuri
1774   Zyaire

[1775 rows x 1 columns]

## Export CSV File with the to_csv Method

In [62]:
url='https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv'
baby_names = pd.read_csv(url)
baby_names.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [63]:
baby_names.columns

Index(['Year of Birth', 'Gender', 'Ethnicity', 'Child's First Name', 'Count',
       'Rank'],
      dtype='object')

### IF spaces between the commas check above

In [69]:
baby_names.to_csv("NYC_Baby_Names.csv", index=False, encoding='utf-8', columns= ['Gender','Ethnicity',"Child's First Name"])

## Import Excel File into pandas with the read_excel Method

In [73]:
df = pd.read_excel('Data - Single Worksheet.xlsx')
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [76]:
pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name= 1)

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [82]:
data=pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name= ['Data 1', 'Data 2'])

In [83]:
type(data)

dict

In [84]:
data

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F}

In [81]:
data[0]

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [85]:
data=pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name= None)

In [86]:
data

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F}

In [87]:
url='https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv'
baby_names = pd.read_csv(url)
baby_names.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [92]:
girls = baby_names[baby_names['Gender']=='FEMALE']
boys = baby_names[baby_names['Gender']=='MALE']

In [93]:
excel_file=pd.ExcelWriter('Baby_Names.xlsx')

In [94]:
girls.to_excel(excel_file, sheet_name='Girls', index=False)

In [95]:
boys.to_excel(excel_file, sheet_name='Boys', index=False, columns=['Gender','Ethnicity',"Child's First Name"])

In [96]:
excel_file.save()